/////////////////////////////Урок №1/////////////////////////////

////////////////////////////1st Task////////////////////////////
/*
alert("Первое задание.");
let t = prompt("Введите температуру в F");

alert(celToFar(t)) + "F";

function celToFar(t){
    return (9/5)*t+32;
}
////////////////////////////////////////////////////////////////

////////////////////////////2nd Task////////////////////////////
let admin = "Василий";
let name = admin;

alert("Второе задание. По итогу которого получаем: " + admin);
/////////////////////////////////////////////////////////////

////////////////////////////4th Task////////////////////////////
console.log(1000+'108');
//В итоге получаем 100108, т.к. происходит сложения числа со строкой.
///////////////////////////////////////////////////////////////
//

alert("Спасибо за первый урок и за проверенной дз!:)");
*/

/////////////////////////////Урок №2/////////////////////////////

////////////////////////////1st Task////////////////////////////

var a = 1, b = 1, c, d;
c = ++a; console.log(c);           // 2 - возвращается значение после увеличение
d = b++; console.log(d);           // 1 - возвращается значение до приращения
c = (2+ ++a); console.log(c);      // 5 - a увеличилось на единицу в последствии первой операции,где c=++a. 
d = (2+ b++); console.log(d);      // 4 - b++ - 2 т.к. вернулось значение до приращения, но после предыдущего приращения
console.log(a);                    // 3 - операция c=(2+ ++a) привела к тому, что 2+ повлияло только на переменную с, а просто увеличился на 1, и по итогу стало 3.
console.log(b);                    // 3 - операция c=(2+ ++a) привела к тому, что 2+ повлияло только на переменную с, b просто увеличился на 1, и по итогу стало 3, но только после того как прошло b++.

////////////////////////////2st Task////////////////////////////

var a=2;
var x= 1 + (a*=2);  //"a" в данной ситуации умножается на 2 и ко всему этому прибавляется 1. На выходе получается, что х-5, а-4
console.log(a,x);


////////////////////////////3st Task////////////////////////////
var a = 2;
var b = -99;

if(a>0 && b>0) 
{
    var result = (a>b) ? a-b : b-a;
    console.log(`Переменные 'a' и 'b' положительные. Произведение их ${result}`);
}
if(a<0 && b<0) console.log(`Переменные 'a' и 'b' отрицательные. Произведение их ${a*b}`);

if(a>=0 && b<0 || a<0 && b>=0) console.log(`Переменные 'a' и 'b' разных знаков. Сумма их ${a+b}`);

a = 10;
let aMax = 15;

switch(a)
{
    case(a<=15):;
    break;
}


function summary(a,b){
    return a+b;
}
function divers(a,b,flag=false){
    return (flag)? b-a : a-b;
}
function increase(a,b){
    return a*b;
}
function division(a,b){
    return a/b;
}

function mathOperation(arg1,arg2,operation){
    switch(operation){
        case("summary"): summary(arg1,arg2)
        break;
        case("divers"): divers(arg1,arg2)
        break;
        case("increase"): increase(arg1,arg2)
        break;
        case("division"): division(arg1,arg2)
        break;
    }
}

console.log(null==0);// результатом будет false, т.к. null и 0 разных типов, но епри сравнении null и undefiend было бы true

function power(value,pow){
     return (pow==0) ? 1 :  value * power(value,pow-1);
}

console.log(`Возведение в степень.${power(1,0)}`);


/////////////////////////////////////////////////////////////////
/////////////////////////////Урок №2/////////////////////////////
/////////////////////////////////////////////////////////////////

////////////////////////////1st Task////////////////////////////


getDeltaInt(1,100);

function getDeltaInt(a,b){
    if(a>b) console.log("Диапазон задан неверно!");
    while(a<=b){
        console.log(a++);
    }
}


////////////////////////////2st Task////////////////////////////
//Задача по интернет-магазину перенес в отдельный js файл "bin.js"


////////////////////////////Задача 4.1 со звездочкой////////////////////////////
for(let i=0;i<10;console.log(i++)){}


////////////////////////////Задача 4.2 со звездочкой////////////////////////////

for(let item = "#"; item.length<=20; console.log(item+="#")){}
